{
  "header": {
    "home": "Home",
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact",
    "open_resume": "Open Resume",
    "download_cv": "Download CV"
  },
  "welcome": {
    "owner_name": "azat farmanyan",
    "owner_profession": "Software Engineer",
    "about_me_button": "About me",
    "open_resume_button": "Open Resume",
    "linkedin_alt": "linkedin",
    "github_alt": "github",
    "telegram_alt": "telegram",
    "discord_alt": "discord",
    "instagram_alt": "instagram",
    "facebook_alt": "facebook"
  },
  "about": {
    "section_title": "About Me",
    "intro_text": "Here you will find more information about me, what I do, and my current skills mostly in terms of programming and technology.",
    "get_to_know_me": "Get to know me!",
    "introduction": "Hello! My name is Azat Farmanyan, and I am a creative and innovative developer and designer with a degree in Information Systems and Technologies, which I obtained in 2023 from Samtskhe-Javakheti State University, Faculty of Engineering, Agriculture, and Life Sciences.",
    "experience_epam": "My journey began at <a href='https://www.epam.com/' target='_blank'><b>Emap</b></a>, where I mastered front-end development through an intensive course at RsSchool and successfully applied the knowledge in practice, participating in real projects and obtaining certification. My experience at <a href='https://www.apacer.com/' target='_blank'><b>Apacer Technology Inc.</b></a> and <a href='https://bet888win.net/' target='_blank'><b>Bet888win</b></a>, where I worked as a graphic designer, allowed me to create visually captivating promotional banners and adapt them for various social platforms, contributing to successful marketing campaigns.",
    "experience_geo_alpha": "At <a href='https://geoalphasolutions.com/' target='_blank'><b>GeoAlphaSolution</b></a>, I made significant contributions to projects such as <a href='https://www.faircontent.media/home' target='_blank'><b><u>FairContent.media</u></b></a> and <a href='http://www.swiftness.co.il/' target='_blank'><b><u>Swiftness</u></b></a>. My expertise in HTML, CSS, SCSS, JavaScript, TypeScript, and Angular helped improve interfaces and work effectively on projects across various domains, maintaining high standards of innovation.",
    "experience_cyberia_soft": "In <a href='https://www.cyberiasoft.com/' target='_blank'><b>CyberiaSoft</b></a>, I spent a year and three months enhancing web store management systems, utilizing HTML, CSS, SCSS, JavaScript, TypeScript, and Angular to create user-friendly interfaces. My work with GitLab and REST APIs, along with the implementation of responsive design techniques, increased user satisfaction and ensured productive collaboration with cross-functional teams.",
    "current_work": "Since March 2024, I have been working at <a href='https://background.digital/' target='_blank'><b>Background Digital</b></a>, where I create web applications for construction complexes such as <a href='https://river-house.ru/' target='_blank'><b><u>River House</u></b></a>, <a href='https://malahovkahouse.ru/' target='_blank'><b><u>Malahovka House</u></b></a>, and <a href='https://3-red.com' target='_blank'><b><u>3 Red</u></b></a>. My skills in Angular 2+, HTML5, CSS3, and SCSS help me develop intuitive and efficient interfaces. I actively use Node.js and Express for the back-end, and testing with Jest/Karma/Jasmine ensures high code quality. My experience working with flexible schedules and official employment under the Labor Code of the Russian Federation confirms my reputation as a reliable and responsible developer.",
    "languages": "I am fluent in Armenian, Georgian, Russian, and English. These language skills enable me to communicate effectively and work in multilingual and international teams. My creativity, technical skills, and ability to quickly adapt to new challenges make me a valuable partner for any project. I always strive for excellence and am ready to use my knowledge to achieve outstanding results.",
    "my_skills": "My Skills"
  },
  "experience-page": {
    "work_experience": "Work experience"
  },
  "experience": [
    {
      "date": {
        "from": "October  2024",
        "to": "Till now",
        "duration": ""
      },
      "title": "Angular Developer",
      "company": "Rick Masters",
      "page": "http://rikmasters.ru/",
      "description": "- Participated in the design and development of web applications using Angular, TypeScript, and RxJS. - Performed code refactoring to enhance performance and maintainability. - Made architectural decisions and implemented a component-based development approach. - Developed responsive layouts and integrated front-end interfaces with backend systems via REST API. - Collaborated closely with designers (Figma), QA engineers, and developers in an Agile (Scrum) environment. - Actively contributed to product development, proposing innovative solutions to improve user experience.",
      "companyLogo": "rik-masters.png"
    },
    {
      "date": {
        "from": "March 2024",
        "to": "Till now",
        "duration": ""
      },
      "title": "Full Stack Engineer",
      "company": "Background Digital",
      "page": "https://background.digital/",
      "description": "- Developed web applications using Angular 2+ for construction project websites, such as https://river-house.ru/, https://malahovkahouse.ru/, and https://3-red.com. - Utilized HTML-5, CSS-3, SCSS, Jade, Swig, ES-5/6 to create efficient and user-friendly interfaces. - Worked with major Git commands for version control. - Additionally applied knowledge of Angular 2, Node.js, Express, Jest/Karma/Jasmine for testing and ensuring code quality. - Maintained high performance levels using modern tools and development methodologies. - Operated under official employment terms as per the Russian Federation Labor Code, with a flexible schedule and remote work options.",
      "companyLogo": "backgound.png"
    },
    {
      "date": {
        "from": "January 2023",
        "to": "March 2024",
        "duration": "1 year 3 months"
      },
      "title": "Angular Developer",
      "company": "CyberiaSoft",
      "page": "https://www.cyberiasoft.com/",
      "description": "- Proficient in HTML, CSS, SCSS, JavaScript, TypeScript, and Angular, responsible for developing and enhancing web-based store management systems. - Collaborated with cross-functional teams to ensure compliance with business requirements, utilizing GitLab for version control and integrating REST APIs for data exchange. - Employed DevExtreme and Frontend JS from DevExtreme to create an interactive and visually appealing user interface, applying RxJS and JSON for efficient data processing. - Implemented responsive design methods to ensure optimal performance on various devices, enhancing user satisfaction. - Followed Agile methodology for efficient feature delivery, using VS Code as the development environment and DevExpress for additional tools and libraries. - Conducted testing and optimization to ensure the quality and performance of systems. - Provided technical support and training to end users, ensuring their effective utilization of web-based store management systems. - Stayed abreast of industry trends for continuous system improvement and maintaining an innovative approach.",
      "companyLogo": "cyberiasoft.png"
    },
    {
      "date": {
        "from": "June 2022",
        "to": "May 2023",
        "duration": "1 year"
      },
      "title": "Angular Developer",
      "company": "GeoAlphaSolution",
      "page": "https://geoalphasolutions.com/",
      "description": "- Contributed significantly to the development of two distinct projects: 1) FairContent.media: Played a key role in creating the online marketplace FairContent.media, enabling users to buy and sell various goods, including books, videos, music, and documents. [Website: https://www.faircontent.media/home] 2) Swiftness: Led efforts in developing Swiftness, a digital platform revolutionizing the pension savings market. [Website: http://www.swiftness.co.il/] - Utilized skills in HTML, CSS, SCSS, JavaScript, TypeScript, and Angular to create user-friendly and responsive interfaces for both projects, significantly enhancing the overall user experience. - Collaborated closely with interdisciplinary teams, ensuring alignment with project goals and business requirements. Used GitHub for version control and REST API integration for efficient data exchange, harnessing the power of RxJS and JSON for seamless data processing. - Demonstrated adaptability, successfully working on diverse projects in various industries, showcasing a flexible skill set and the ability to learn and adapt quickly to changing conditions. - Maintained a high level of innovation and efficiency, staying abreast of the latest trends in Angular development. Used development tools such as VS Code for smooth and productive workflows. Applied object-oriented programming (OOP) principles and ES6 functionality to create robust and maintainable code. - Additionally, used Figma for collaborative design work and integrated VisualStudio and VS Code into the development process to ensure code quality and consistency.",
      "companyLogo": "GeoAlpha-Solutions.png"
    },
    {
      "date": {
        "from": "February 2022",
        "to": "October 2022",
        "duration": "9 months"
      },
      "title": "Angular Developer",
      "company": "Emap - RsSchool",
      "page": "https://www.epam.com/",
      "description": "- Participated in an intensive Front-End development program at Emap - RsSchool, initiating my immersion into the world of web development. Mastered a comprehensive skill set, including HTML, CSS, JavaScript, TypeScript, and Angular, laying a solid foundation for modern web development. Thrived in a demanding and rigorous educational environment with a high attrition rate, where only 46 out of 600 participants demonstrated commitment, perseverance, and completed the program. Proud to be among the dedicated individuals who achieved this significant milestone. Effectively applied acquired knowledge and skills in real-world projects, gaining practical experience in designing and developing user-friendly web interfaces. Attained significant success, receiving a completion certificate confirming my expertise in Front-End development and validating my commitment to excellence in this field. Kept abreast of the latest trends and best practices in web development, ensuring my stay at the forefront of this constantly evolving field. Utilized tools such as Figma for web design, Git and Github for version control, REST API for data integration, and RxJS for efficient data processing. Applied JSON for data exchange and optimized code using VS Code and VisualStudio. Proficiently used Chrome DevTools for debugging and enhancing web applications.",
      "companyLogo": "epam.png"
    },
    {
      "date": {
        "from": "June 2019",
        "to": "May 2021",
        "duration": "2 years"
      },
      "title": "Graphic Designer",
      "company": "Apacer Technology Inc.",
      "page": "https://www.apacer.com/",
      "description": "- Specialized in creating eyecatching advertising banners tailored specifically for social media platforms. - Collaborated closely with marketing teams to ensure effective product messaging through visually appealing content. - Adapted designs to meet the unique requirements of various social media platforms, optimizing their visual impact and ensuring a seamless user experience. - Conducted A/B testing and made adjustments based on data, continually improving engagement levels and click-through rates, thereby enhancing the overall effectiveness of advertising campaigns. - Made a significant contribution to the companys marketing efforts by crafting visually appealing and conversion-focused advertising materials for social media campaigns, utilizing design software such as Adobe Photoshop, Adobe Illustrator, and Figma.",
      "companyLogo": "Apacer-Logo.png"
    },
    {
      "date": {
        "from": "May 2018",
        "to": "August 2019",
        "duration": "1 year 4 months"
      },
      "title": "Graphic Designer",
      "company": "Bet888win",
      "page": "https://bet888win.net/",
      "description": "- Created dynamic footballthemed advertising banners specifically tailored for social media platforms to promote matches and events. - Collaborated closely with marketing teams to ensure the timely creation of compelling content that resonated with the target audience. - Utilized design skills with tools such as Adobe Photoshop, Adobe Illustrator, and Figma to craft visually appealing banners that encouraged higher user engagement. - Adapted and optimized designs to meet the specific requirements of various social media platforms, ensuring effective reach and engagement with the target audience.",
      "companyLogo": "bet-888.png"
    }
  ],
  "projects": {
    "section_title": "PROJECTS",
    "projects_text": "Here you will find some of the personal and clients projects that I created with each project containing its own case study",
    "projects_list": [
      {
        "id": 19,
        "title": "User Filter Application",
        "description": [
          "This project is a web application built with Angular that allows users to filter a list of users retrieved from a server. For the purpose of this test assignment, I simulated the server using a local JSON file to fetch user data.",
          "Key features include input validation using regular expressions, client-side filtering based on the received data, and toggling the 'Block/Unblock' status for each user. This status is stored in the browser's local storage, ensuring that the updated value is reflected when the page is reloaded.",
          "The main objective of this project is to demonstrate working with forms, inputs, and tables, as well as creating services and facilitating interaction between components. The application provides a clean and efficient user interface for filtering, validating, and managing user data."
        ],
        "banner": "user-filter-app-screenshot1.png",
        "bannerSmall": "user-filter-app-banner-small.png",
        "screenshots": [
          "user-filter-app-screenshot2.png",
          "user-filter-app-screenshot1.png"
        ],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "TypeScript",
          "RxJs",
          "VS Code",
          "Figma"
        ],
        "seeLive": "https://user-filter-app-angular.netlify.app/user-settings",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/UserFilterApp",
        "designTemplate": "https://www.figma.com/file/NcDTaAYcLBL6ogy1Nxf5Ey/testcase-rik-angular?node-id=0%3A1&t=ZCRud6nfITOJa0sw-1",
        "isNewProject": true
      },
      {
        "id": 18,
        "title": "Currency Converter",
        "description": [
          "Our project is a simple web application built on Angular for convenient currency conversion. It allows users to quickly convert amounts between different currencies, ensuring accuracy at each step of the process.",
          "List of main features: Currency selection and conversion; Currency switching; Input of amount to convert; Validation of entered data; Display of accurate results considering the current exchange rate.",
          "We fetch currency exchange rate data using the API from App.FreeCurrencyApi.com, which enables us to provide up-to-date and real-time results. The goal of the project is to offer a simple yet effective tool for quick currency conversion. We utilize Angular 17, HTML/SCSS, TypeScript, RxJs, REST API, and input data validation to ensure result accuracy."
        ],
        "banner": "currency-converter-app-banner.png",
        "bannerSmall": "currency-converter-app-banner-small.png",
        "screenshots": ["currency-converter-app-banner.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "TypeScript",
          "RxJs",
          "VS Code",
          "Figma"
        ],
        "seeLive": "https://currency-converter-ng17.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/currency-converter-app",
        "isNewProject": true
      },
      {
        "id": 17,
        "title": "Product Page",
        "description": [
          "My work on the product page layout in Angular 17 goes beyond the basic 'Add to Cart' button. I have implemented several other engaging elements to enhance user experience. Specifically, I have created a convenient search input field with the ability to clear entered text and a search button for user convenience.",
          "In addition to this, the page features buttons for toggling notifications and adding the product to favorites, complete with eye-catching animations. Each button dynamically responds to hover, focus, and active states, adding an extra layer of interactivity and user-friendliness to the page.",
          "Finally, I have also implemented a slider scroll functionality on the product page, allowing users to easily browse through additional images and information about the product. All the markup is done using Angular 17.2, with the page divided into small components for easy management and project maintainability."
        ],
        "banner": "compoProductPage-banner.png",
        "bannerSmall": "compoProductPage-small-banner.png",
        "screenshots": ["compoProductPage-banner.png"],
        "tools": ["Angular", "HTML", "SCSS", "TypeScript", "VS Code", "Figma"],
        "seeLive": "https://dancing-rolypoly-6860d4.netlify.app/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/compo-product-page",
        "designTemplate": "https://www.figma.com/file/QIdMZetqc6405W0CUam7Fa/Product-Page?type=design&node-id=0%3A1&mode=design&t=fehYwRXnmepOBg3k-1"
      },

      {
        "id": 16,
        "title": "Interactive Table",
        "description": [
          "The Angular project entails the development of a functional table offering an array of features. This includes sorting, filtering, pagination, and customizable column visibility. Leveraging Angular's event binding mechanism, users can sort rows with a simple click on column headers. Additionally, a search input field facilitates quick data filtering and retrieval. Users have the flexibility to define the number of records per page and navigate seamlessly through pages via pagination. To enhance user experience, the interface allows for the hiding or showing of specific columns, ensuring tailored data presentation. The project prioritizes high-quality code standards and user accessibility across various devices through the implementation of responsive design techniques.",
          "In summary, the Angular project delivers a comprehensive solution for efficient data management within a table format. Its advanced functionalities cater to diverse user needs, from sorting and filtering to customizable views, all while upholding superior code quality and ensuring a seamless user experience across different platforms."
        ],
        "banner": "interactive_table-banner_1.png",
        "bannerSmall": "interactive_table-banner_small.png",
        "screenshots": [
          "interactive_table-banner_1.png",
          "interactive_table-banner_2.png",
          "interactive_table-banner_3.png"
        ],
        "tools": ["Angular", "HTML", "SCSS", "TypeScript", "VS Code", "Figma"],
        "seeLive": "https://funny-pixie-42e682.netlify.app/dataTable",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/AngularInteractiveTable"
      },
      {
        "id": 15,
        "title": "Crypto World",
        "description": [
          "Embark on a captivating journey into the cryptocurrency realm with Crypto World, a sophisticated web application developed using Angular. This project showcases my expertise in front-end development, offering users a seamlessly integrated experience across various features.",
          "At the heart of Crypto World is a user-friendly dashboard providing real-time insights into portfolios, transactions, and market trends. Explore the extensive market section, engage in live trading on popular exchanges, and stay ahead of trends with the trending module. With responsive design and enhanced security features, Crypto World is a dynamic ecosystem designed to cater to both seasoned cryptocurrency enthusiasts and newcomers, emphasizing a commitment to delivering an exceptional user experience."
        ],
        "banner": "crypto-world-banner.png",
        "bannerSmall": "crypto-world-banner-small.png",
        "screenshots": [
          "crypto-world-banner.png",
          "crypto-world-banner-2.png",
          "crypto-world-banner-3.png",
          "crypto-world-banner-4.png"
        ],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "TypeScript",
          "VS Code",
          "Figma",
          "Photoshop"
        ],
        "seeLive": "https://chipper-maamoul-e7653e.netlify.app/dashboard",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/CryptoWORLD"
      },
      {
        "id": 14,
        "title": "MP3 Player",
        "description": [
          "Angular MP3 Player: Explore the Rhythm of Music. Step into the world of harmony with our Angular MP3 Player, a seamless gateway to your favorite tunes. This simple yet elegant application offers a captivating experience for music enthusiasts.",
          "With a collection of diverse tracks at your fingertips, you are free to immerse yourself in a world of melodies. Our user-friendly interface provides effortless navigation, making it a breeze to play, pause, skip forward, or go back, all with a single click.",
          "Experience the pure joy of music without the clutter. Whether you are relishing the soothing tunes of a classic or grooving to the rhythms of modern beats, our Angular MP3 Player ensures that you are always in control of your musical journey.",
          "So, why wait? Dive into the music, let the notes carry you away, and rediscover the joy of simple yet delightful soundscapes. It is more than an application; it is a portal to the symphony of life."
        ],
        "banner": "player-1.png",
        "bannerSmall": "mp3-player-banner-small.png",
        "screenshots": ["player-1.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "VS Code",
          "Figma"
        ],
        "seeLive": "https://loquacious-unicorn-9da2c9.netlify.app/player",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/music-player"
      },
      {
        "id": 13,
        "title": "Pizza Cheff",
        "description": [
          "Pizza Cheff is a mouthwatering culinary project designed to celebrate the art of pizza-making. This visually enticing webpage offers a tantalizing glimpse into the world of cheesy, saucy, and delicious pizzas. From classic Margheritas to adventurous flavor combinations, Pizza Cheff showcases an extensive array of delectable options, sure to satisfy every pizza lover's cravings.",
          "Our webpage provides a feast for the eyes with high-quality images of meticulously crafted pizzas that will make your taste buds tingle. Pizza Cheff also offers easy-to-follow recipes and step-by-step guides, making it a go-to resource for aspiring home chefs looking to replicate the magic of pizzerias right in their own kitchens.",
          "At Pizza Cheff, we are not just about pizza; we are about sharing a passion for the culinary arts. Whether you are a seasoned pro or a novice, this page is your gateway to a world of savory satisfaction. Join us on this delightful pizza journey and discover the secrets to crafting pizza perfection.",
          "With its delectable visuals and comprehensive guides, Pizza Cheff is a testament to the delicious and creative world of pizza-making. Dive into our page, and you will soon be on your way to mastering the art of pizza."
        ],
        "banner": "pizza-cheff.png",
        "bannerSmall": "pizza-cheff-banner-small.jpg",
        "screenshots": ["pizza-cheff.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://papaya-praline-2e765d.netlify.app/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/pizzaCheff"
      },
      {
        "id": 12,
        "title": "Posts App",
        "description": [
          "Welcome to the Posts App, your personal portal to a world of stories, shared experiences, and connections. Whether you are a seasoned blogger, an avid reader, or someone looking to connect with like-minded individuals, our application is designed to bring the world of posts and stories to your fingertips.",
          "With the Posts App, users can create accounts, log in, and embark on a journey of exploration. Once logged in, you will have access to a vast array of posts, each telling a unique tale or sharing valuable insights. Whether you are into travel stories, lifestyle blogs, or tech reviews, you will find a diverse range of content to engage with.",
          "But the Posts App is not just about reading; it is about connecting. Explore user profiles and about cards to learn more about the writers behind the posts. Discover shared interests, connect with fellow enthusiasts, and engage in meaningful discussions with those who share your passion.",
          "Join the growing community of readers and writers who have made the Posts App their go-to platform for storytelling and connecting. Whether you are here to share your own posts or discover new perspectives, our app is your doorway to a world of stories and connections. Download the Posts App today and start sharing, discovering, and connecting in a new and exciting way!"
        ],
        "banner": "posts-app-2.png",
        "bannerSmall": "posts-app-banner-small.jpg",
        "screenshots": [
          "posts-app-1.png",
          "posts-app-2.png",
          "posts-app-3.png"
        ],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://mypostsapp.netlify.app/login",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/postsApp"
      },

      {
        "id": 11,
        "title": "Users App",
        "description": [
          "Welcome to the Users App, your one-stop solution for seamless user management. Whether you are an administrator, a community organizer, or simply need an efficient way to manage user profiles, our application is designed to simplify the process and put you in control.",
          "With the Users App, you can effortlessly create and display user profiles complete with portraits. Each profile is customizable, allowing you to add and edit user details, including their portrait, name, contact information, and more. Gone are the days of sifting through paperwork or multiple spreadsheets; our app streamlines user management into a user-friendly interface.",
          "Need to update a user's information or portrait? No problem. The Users App makes it easy to make changes in real-time, ensuring your records are always up-to-date. And if it is time to bid farewell to a user, our app offers a simple deletion feature, allowing you to remove profiles with ease while maintaining data integrity.",
          "Join the growing community of users who rely on the Users App for efficient and organized user management. Whether you are running a small organization or managing a large user database, our app has you covered. It is time to take control of your user profiles and make user management a breeze. Download the Users App today and experience the convenience of streamlined user management firsthand!"
        ],
        "banner": "card-app-1.png",
        "bannerSmall": "card-app-banner-small.jpg",
        "screenshots": ["card-app-1.png", "card-app-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://majestic-melomakarona-c93ab4.netlify.app/users-page",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/UsersApp_Angular"
      },
      {
        "id": 10,
        "title": "World Putting League",
        "description": [
          "Welcome to the World Putting League, the epicenter of precision and passion in the world of golf. Dive into a unique golfing experience where putting prowess takes center stage and players from around the globe come together to showcase their skills.",
          "Our league is more than just a competition; it is a celebration of the art and science of putting. Whether you are a seasoned pro or a newcomer to the green, the World Putting League offers a platform for everyone to participate and compete. Our inclusive environment fosters camaraderie and sportsmanship while pushing the boundaries of what is possible on the putting green.",
          "Stay updated with the latest scores, rankings, and events as you immerse yourself in the thrilling world of putting. With a community of passionate golfers and enthusiasts, the World Putting League is where dreams are made, records are shattered, and lifelong friendships are forged.",
          "Join us on this journey where every putt counts, and the pursuit of perfection knows no bounds. Whether you are a golfer by heart or just intrigued by the allure of precision, the World Putting League welcomes you to experience golf in a whole new way. Get ready to roll with us and discover the magic of putting like never before."
        ],
        "banner": "wpl-banner.jpg",
        "bannerSmall": "wpl-banner-small.jpg",
        "screenshots": ["wpl-1.png", "wpl-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://unrivaled-duckanoo-78dd09.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/world-putting-league"
      },
      {
        "id": 9,
        "title": "Speed Typing App",
        "description": [
          "Welcome to the Speed Typing App, your ultimate tool for enhancing your typing proficiency. Whether you are a professional looking to boost productivity or a learner aiming to improve your keyboard prowess, our application is designed to help you achieve your typing goals with precision and efficiency.",
          "Our Speed Typing App offers a range of customizable features, allowing you to tailor your typing practice to your specific needs. You can choose your preferred timer, set word goals, and select difficulty levels to create a personalized typing experience. Whether you have just a few minutes to spare or want to embark on a more extensive typing session, our app adapts to your schedule.",
          "As you type, the Speed Typing App provides real-time feedback, tracking your speed, accuracy, and word count. It offers a library of words and phrases to challenge and engage your typing skills continually. With each session, you will find yourself typing faster, more accurately, and with greater confidence.",
          "Join the growing community of typists who have improved their skills with our Speed Typing App. Whether you are preparing for a job that requires lightning-fast typing or simply want to be more efficient with your daily tasks, our app is your ideal companion. Download it today and watch your typing abilities soar to new heights!"
        ],
        "banner": "speen-typing-banner.jpg",
        "bannerSmall": "speen-typing-banner-small.jpg",
        "screenshots": ["speen-typing-1.png", "speen-typing-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://chic-cat-2246b2.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/speed-typing-Angular-app"
      },
      {
        "id": 8,
        "title": "Blot Card Game",
        "description": [
          "Welcome to the Note Card Game Blots Score, your ultimate scoring companion for this classic and exciting card game. Whether you're a seasoned Blot player or just starting your journey, our application is designed to make keeping score a breeze and add a touch of elegance to your gaming experience.",
          "With our user-friendly and intuitive interface, you can focus on the game while effortlessly tracking your scores. No more fumbling with pen and paper or trying to remember who's winning; our app takes care of all the math for you. Simply input the scores, and let the Note Card Game Blots Score do the rest.",
          "But we don't stop at functionality; we believe in adding a touch of style to your gaming. Our app offers customizable themes and visually appealing scorecards to enhance your Blot gaming experience. Whether you prefer classic elegance or a more modern look, you can choose a theme that suits your taste.",
          "Join the Blot gaming community and elevate your card-playing sessions with our Note Card Game Blots Score app. It's not just about keeping score; it's about enhancing your gaming moments with ease and sophistication. Download our app today and score your way to victory in style!"
        ],
        "banner": "blot-app-banner.png",
        "bannerSmall": "blot-app-banner-small.png",
        "screenshots": ["blot-app-1.png", "blot-app-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://steady-biscotti-58c415.netlify.app/blot",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/blot-app"
      },
      {
        "id": 7,
        "title": "Weather App",
        "description": [
          "Welcome to the Weather App, your reliable companion for staying informed about the ever-changing skies. With our user-friendly and intuitive application, you will have the power to access up-to-the-minute weather forecasts and stay one step ahead of Mother Nature.",
          "Our Weather App offers a seamless experience, providing you with accurate and detailed weather information at your fingertips. Whether you are planning a weekend getaway, scheduling outdoor activities, or simply want to know what to expect on your daily commute, our app has you covered.",
          "Stay informed with real-time weather updates, temperature trends, precipitation forecasts, and more. With an easy-to-navigate interface and customizable features, you can tailor your weather experience to suit your needs. Whether you are a weather enthusiast or just want to know if you will need an umbrella, our Weather App is here to make your day brighter and more predictable.",
          "Join the millions of users who rely on our app for their daily weather updates. Embrace the convenience of knowing the forecast wherever you go, and be prepared for whatever the weather may bring. Download our Weather App today and stay ahead of the elements!"
        ],
        "banner": "weather-app-banner.jpg",
        "bannerSmall": "weather-app-banner-small.jpg",
        "screenshots": [
          "weather-app-1.png",
          "weather-app-2.png",
          "weather-app-3.png"
        ],
        "tools": [
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Angular",
          "Figma"
        ],
        "seeLive": "https://deft-liger-7c9069.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/weather-app"
      },
      {
        "id": 6,
        "title": "English for Kids",
        "description": [
          "Introducing 'English for Kids,' an engaging and educational application specially crafted for children eager to embark on a journey of English language discovery. Designed with young learners in mind, our app offers two exciting modes that make language acquisition a joyful adventure.",
          "In the 'Training Mode,' children can dive into a world of knowledge and explore new words with interactive lessons and colorful visuals. Learning becomes a playful experience as kids absorb vocabulary, pronunciation, and basic language skills at their own pace. With our user-friendly interface and engaging content, young minds can build a solid foundation in English, setting them on a path to success.",
          "For those moments of delightful exploration, the 'Game Mode' awaits. Here, children can put their newfound knowledge to the test in a thrilling game of picture guessing. Imagination and language skills come together as kids identify objects, animals, and more, all while reinforcing their English vocabulary in a fun and interactive way.",
          "'English for Kids' is more than an app; it is an educational companion that fosters a love for language and learning. Join us in this exciting journey, where children can expand their horizons, boost their confidence, and embark on a lifelong adventure of language and discovery. Give your child the gift of English education wrapped in fun and excitement today!"
        ],
        "banner": "english-banner.jpg",
        "bannerSmall": "english-banner-small.jpg",
        "screenshots": [
          "english-2.png",
          "english-1.png",
          "english-3.png",
          "english-4.png",
          "english-5.png"
        ],
        "tools": ["HTML", "SCSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/English-for-kids/English-for-kids/pages/main/#",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/English-for-kids"
      },
      {
        "id": 5,
        "title": "Project Management System",
        "description": [
          "Welcome to our Project Management System, a powerful application designed to assist individuals, teams, or groups of developers in achieving their goals efficiently and effectively. In today's fast-paced world, where collaboration and organization are key, our system offers a comprehensive solution to streamline your project management needs.",
          "In a highly competitive market, we understand that choices abound. Notable competitors like Trello, Jira, Redmine, Bitrix24, Yandex Tracker, Asana, GanttPro, and Github projects have all made their mark. However, our Project Management System stands out as a robust and user-friendly option, tailored to meet the specific needs of modern teams. With an array of features, intuitive interface, and customizable functionality, we aim to empower you to take control of your projects and drive success.",
          "Join the ranks of satisfied users who have discovered the benefits of our Project Management System. Explore the tools, enhance your productivity, and experience the difference for yourself. Whether you are a seasoned project manager or just embarking on your journey, we are here to help you reach your goals efficiently and with confidence. Welcome to the future of project management!"
        ],
        "banner": "proj-man-sys-banner.jpg",
        "bannerSmall": "proj-man-sys-banner-small.jpg",
        "screenshots": [
          "proj-man-sys-1.png",
          "proj-man-sys-2.png",
          "proj-man-sys-3.png"
        ],
        "tools": [
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Angular",
          "Figma"
        ],
        "seeLive": "https://fascinating-douhua-c23dc0.netlify.app/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/rs-front-azat"
      },
      {
        "id": 4,
        "title": "Shelter Dogs and Cats",
        "description": [
          "Welcome to Shelter Dogs and Cats, a heartwarming online platform dedicated to our furry friends in need. Our mission is simple yet profound: to connect deserving shelter dogs and cats with loving forever homes.",
          "On our website, you'll find a wealth of detailed information about the wonderful animals residing in shelters, eagerly waiting for their future owners. Each profile tells a unique story, showcasing the personality, history, and individual needs of these lovable companions. Whether you're seeking a loyal canine companion or a charming feline friend, you can explore our comprehensive listings to discover the perfect match for your home and heart.",
          "We believe that every paw deserves a place to call home, and we're here to make that happen. Join us in this heartwarming journey of compassion and adoption, where together, we can transform the lives of shelter dogs and cats, and bring joy and love into your home. Explore our website, meet our furry residents, and start the beautiful journey of pet adoption today."
        ],
        "banner": "shelter-banner.jpg",
        "bannerSmall": "shelter-banner-small.jpg",
        "screenshots": ["shelter-1.png", "shelter-2.png"],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/shelter/pages/main/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/shelter"
      },
      {
        "id": 3,
        "title": "Tic Tac Toe",
        "description": [
          "Enter the world of Ultimate Tic Tac Toe, where strategic brilliance meets timeless fun. This classic game has been reimagined and supercharged for the digital age. Whether you are a seasoned strategist or new to the game, Ultimate Tic Tac Toe promises an exhilarating experience that challenges your wits and captivates your competitive spirit.",
          "Our digital version of Tic Tac Toe comes to life with sleek design and intuitive gameplay. Play against friends, family, or AI opponents with varying levels of difficulty. With responsive controls optimized for web and mobile, you can enjoy Ultimate Tic Tac Toe on your device of choice.",
          "But this is no ordinary Tic Tac Toe; it's the Ultimate version. Multiple boards, dynamic play, and strategic depth await. Every move you make influences the game at large, adding layers of complexity and excitement. Will you seize the opportunity to win on the grand board, or will your opponent outmaneuver you? Only the most skilled players will emerge victorious.",
          "Ultimate Tic Tac Toe is more than just a game; it's an invitation to challenge your mind, test your strategy, and share moments of triumph with friends and rivals alike. Join us in this ultimate gaming adventure and see if you have what it takes to conquer the board!"
        ],
        "banner": "tic-tac-toe-1.png",
        "bannerSmall": "tic-tac-toe-banner-small.jpg",
        "screenshots": [
          "tic-tac-toe-1.png",
          "tic-tac-toe-2.png",
          "tic-tac-toe-3.png"
        ],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/TicTacToe/pages/game/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/TicTacToe"
      },
      {
        "id": 2,
        "title": "Calculator",
        "description": [
          "Introducing the Ultimate Calculator, your versatile and responsive companion for all your mathematical needs, whether you are on your computer or your mobile device. We have taken the humble calculator and transformed it into a sleek, user-friendly tool that adapts to your every calculation, no matter where you are. On your computer or laptop, our web-based calculator offers a seamless and intuitive experience. Whether it is simple arithmetic or complex equations, our calculator's responsive design ensures that you have a powerful calculation tool at your fingertips.",
          "But we did not stop there. The Ultimate Calculator is also your trusted ally on mobile devices. Need to make quick calculations while on the go? No problem! Our mobile-friendly interface adapts effortlessly to your smartphone or tablet, delivering the same precision and ease of use you expect. From basic addition to advanced trigonometry, the Ultimate Calculator is your go-to tool for all your mathematical adventures. It is not just a calculator; it is a flexible and responsive mathematical companion that is ready to assist you anytime, anywhere. Join us and simplify your calculations with style and convenience."
        ],
        "banner": "calc.png",
        "bannerSmall": "calc-banner-small.jpg",
        "screenshots": ["calc.png"],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/calculator/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/calculator"
      },
      {
        "id": 1,
        "title": "Book Shop",
        "description": [
          "Welcome to Bookshop, a digital haven for bibliophiles and bookworms. Immerse yourself in a world where the written word reigns supreme. This virtual bookshop is more than just an online store; it is a sanctuary for all things literary. Explore an extensive collection of books spanning genres, eras, and cultures. Craft your own literary journey by curating your personal library with a simple click. And for those moments when you are on the hunt for a specific title, our search feature serves as your trusty guide. Bookshop transcends mere e-commerce; it is a celebration of the enduring magic of the written word. Join us in this literary adventure and let your love for books flourish."
        ],
        "banner": "bookshop-banner.jpg",
        "bannerSmall": "bookshop-banner-small.jpg",
        "screenshots": ["bookshop-1.png", "bookshop-2.png"],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/BookShop/pages/main/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/BookShop"
      }
    ]
  },
  "project-card": {
    "see_more": "See More"
  },
  "project-detail-page": {
    "overview": "Project Overview",
    "tools": "Tools Used",
    "see_live": "See Live",
    "see_demo": "SEE DEMO",
    "source_code": "Source Code",
    "see_design": "See Design",
    "go_back": "Go Back",
    "return": "Return",
    "return_to_projects": "Return to Projects"
  },
  "steps": {
    "step1": {
      "title": "Step 1: Accessing the Demo Version",
      "description": "You're just one click away from exploring our demo version!",
      "button": "Continue"
    },
    "step2": {
      "title": "Step 2: Error Handling",
      "description": "If you encounter any issues, don't worry. Simply click the \"Back to Our Site\" button below, and you will be redirected to the project main page.",
      "button": "Continue",
      "backButtonText": "\"Back to Our Site\""
    },
    "step3": {
      "title": "Step 3: We're Here to Help",
      "description": "If you have any questions or need assistance, please don't hesitate to",
      "spanText": "contact our support team",
      "additionalText": "We're here to assist you. Thank you for your interest in our project, and we look forward to providing you with an excellent experience.",
      "button": "See Demo"
    }
  },
  "contact": {
    "section_title": "CONTACT",
    "description": "Feel free to contact me by submitting the form below and I will get back to you as soon as possible.",
    "name": "Name",
    "name_placeholder": "Enter your name",
    "name_required": "Name is required",
    "email": "Email",
    "email_placeholder": "Enter your email",
    "email_required": "Email is required",
    "email_invalid": "Email is invalid",
    "message": "Message",
    "message_placeholder": "Enter your message",
    "message_required": "Message is required",
    "submit_button": "Submit"
  },
  "footer": {
    "name": "Azat Farmanyan",
    "description": "A Frontend focused Web Developer building the Frontend of Websites and Web Applications that leads to the success of the overall product.",
    "social_title": "Social",
    "copyright": "© Copyright 2023. Made by <a href='/home#home'>Azat Farmanyan</a>",
    "navigation": "Navigation"
  }
}
