{
  "header": {
    "home": "Главная",
    "about": "Обо мне",
    "experience": "Опыт",
    "projects": "Проекты",
    "contact": "Контакты",
    "open_resume": "Открыть Резюме"
  },
  "welcome": {
    "owner_name": "азат фарманян",
    "owner_profession": "Инженер-программист",
    "about_me_button": "Обо мне",
    "open_resume_button": "Открыть Резюме",
    "linkedin_alt": "linkedin",
    "github_alt": "github",
    "telegram_alt": "telegram",
    "discord_alt": "discord",
    "instagram_alt": "instagram",
    "facebook_alt": "facebook"
  },
  "about": {
    "section_title": "Обо мне",
    "intro_text": "Здесь вы найдете больше информации обо мне, чем я занимаюсь, и мои текущие навыки в основном в области программирования и технологий.",
    "get_to_know_me": "Познакомьтесь со мной!",
    "introduction": "Здравствуйте! Меня зовут Азат Фарманян, я креативный и инновационный разработчик и дизайнер с дипломом по информационным системам и технологиям, который я получил в 2023 году в Самцхе-Джавахетском государственном университете на факультете инженерии, сельского хозяйства и жизненных наук.",
    "experience_epam": "Мое путешествие началось в <a href='https://www.epam.com/' target='_blank'><b>Emap</b></a>, где я освоил фронтенд-разработку через интенсивный курс в RsSchool и успешно применил знания на практике, участвуя в реальных проектах и получив сертификат. Мой опыт работы в <a href='https://www.apacer.com/' target='_blank'><b>Apacer Technology Inc.</b></a> и <a href='https://bet888win.net/' target='_blank'><b>Bet888win</b></a>, где я работал графическим дизайнером, позволил мне создавать визуально привлекательные рекламные баннеры и адаптировать их для различных социальных платформ, способствуя успешным маркетинговым кампаниям.",
    "experience_geo_alpha": "В <a href='https://geoalphasolutions.com/' target='_blank'><b>GeoAlphaSolution</b></a> я внес значительный вклад в проекты, такие как <a href='https://www.faircontent.media/home' target='_blank'><b><u>FairContent.media</u></b></a> и <a href='http://www.swiftness.co.il/' target='_blank'><b><u>Swiftness</u></b></a>. Мои знания HTML, CSS, SCSS, JavaScript, TypeScript и Angular помогли улучшить интерфейсы и эффективно работать над проектами в различных областях, поддерживая высокие стандарты инноваций.",
    "experience_cyberia_soft": "В <a href='https://www.cyberiasoft.com/' target='_blank'><b>CyberiaSoft</b></a> я провел год и три месяца, улучшая системы управления веб-магазинами, используя HTML, CSS, SCSS, JavaScript, TypeScript и Angular для создания удобных интерфейсов. Моя работа с GitLab и REST API, а также внедрение адаптивного дизайна увеличили удовлетворенность пользователей и обеспечили продуктивное сотрудничество с межфункциональными командами.",
    "current_work": "С марта 2024 года я работаю в <a href='https://background.digital/' target='_blank'><b>Background Digital</b></a>, где создаю веб-приложения для строительных комплексов, таких как <a href='https://river-house.ru/' target='_blank'><b><u>River House</u></b></a>, <a href='https://malahovkahouse.ru/' target='_blank'><b><u>Malahovka House</u></b></a> и <a href='https://3-red.com' target='_blank'><b><u>3 Red</u></b></a>. Мои навыки в Angular 2+, HTML5, CSS3 и SCSS помогают мне разрабатывать интуитивно понятные и эффективные интерфейсы. Я активно использую Node.js и Express для бэкэнда, а тестирование с помощью Jest/Karma/Jasmine обеспечивает высокое качество кода. Мой опыт работы с гибкими графиками и официальное трудоустройство по Трудовому кодексу РФ подтверждают мою репутацию надежного и ответственного разработчика.",
    "languages": "Я свободно владею армянским, грузинским, русским и английским языками. Эти языковые навыки позволяют мне эффективно общаться и работать в многоязычных и международных командах. Моя креативность, технические навыки и способность быстро адаптироваться к новым вызовам делают меня ценным партнером для любого проекта. Я всегда стремлюсь к совершенству и готов использовать свои знания для достижения выдающихся результатов.",
    "my_skills": "Мои навыки"
  },
  "experience": [
    {
      "date": {
        "from": "Март 2024",
        "to": "По настоящее время",
        "duration": ""
      },
      "title": "Full Stack Engineer",
      "company": "Background Digital",
      "page": "https://background.digital/",
      "description": "- Разработал веб-приложения с использованием Angular 2+ для сайтов строительных проектов, таких как https://river-house.ru/, https://malahovkahouse.ru/, и https://3-red.com. - Использовал HTML-5, CSS-3, SCSS, Jade, Swig, ES-5/6 для создания эффективных и удобных интерфейсов. - Работал с основными командами Git для контроля версий. - Также применял знания Angular 2, Node.js, Express, Jest/Karma/Jasmine для тестирования и обеспечения качества кода. - Поддерживал высокий уровень производительности с использованием современных инструментов и методологий разработки. - Работал в соответствии с официальными условиями трудового договора по Трудовому кодексу Российской Федерации, с гибким графиком и возможностью удаленной работы.",
      "companyLogo": ""
    },
    {
      "date": {
        "from": "Январь 2023",
        "to": "Март 2024",
        "duration": "1 год 3 месяца"
      },
      "title": "Angular Developer",
      "company": "CyberiaSoft",
      "page": "https://www.cyberiasoft.com/",
      "description": "- Владение HTML, CSS, SCSS, JavaScript, TypeScript и Angular, разработка и улучшение веб-ориентированных систем управления магазинами. - Сотрудничество с межфункциональными командами для обеспечения соответствия бизнес-требованиям, использование GitLab для контроля версий и интеграция REST API для обмена данными. - Применение DevExtreme и Frontend JS от DevExtreme для создания интерактивного и визуально привлекательного пользовательского интерфейса, использование RxJS и JSON для эффективной обработки данных. - Реализация методов адаптивного дизайна для обеспечения оптимальной работы на различных устройствах, улучшение пользовательского опыта. - Соблюдение методологии Agile для эффективной доставки функций, использование VS Code в качестве среды разработки и DevExpress для дополнительных инструментов и библиотек. - Проведение тестирования и оптимизации для обеспечения качества и производительности систем. - Предоставление технической поддержки и обучения конечным пользователям, обеспечение их эффективного использования веб-ориентированных систем управления магазинами. - Следование актуальным трендам в индустрии для постоянного улучшения системы и поддержания инновационного подхода.",
      "companyLogo": ""
    },
    {
      "date": {
        "from": "Июнь 2022",
        "to": "Май 2023",
        "duration": "1 год"
      },
      "title": "Angular Developer",
      "company": "GeoAlphaSolution",
      "page": "https://geoalphasolutions.com/",
      "description": "- Существенный вклад в разработку двух различных проектов: 1) FairContent.media: Важная роль в создании онлайн-рынка FairContent.media, позволяющего пользователям покупать и продавать различные товары, включая книги, видео, музыку и документы. [Сайт: https://www.faircontent.media/home] 2) Swiftness: Руководство разработкой Swiftness, цифровой платформы, революционизирующей рынок пенсионных накоплений. [Сайт: http://www.swiftness.co.il/] - Применение навыков в HTML, CSS, SCSS, JavaScript, TypeScript и Angular для создания удобных и адаптивных интерфейсов для обоих проектов, значительно улучшение общего пользовательского опыта. - Тесное сотрудничество с междисциплинарными командами, обеспечение соответствия проектным целям и бизнес-требованиям. Использование GitHub для контроля версий и интеграции REST API для эффективного обмена данными, использование RxJS и JSON для бесшовной обработки данных. - Демонстрация гибкости, успешная работа над разнообразными проектами в различных отраслях, демонстрация гибкого набора навыков и способности быстро адаптироваться к меняющимся условиям. - Поддержание высокого уровня инноваций и эффективности, отслеживание последних тенденций в разработке Angular. Использование инструментов разработки, таких как VS Code, для плавного и продуктивного рабочего процесса. Применение принципов объектно-ориентированного программирования (OOP) и функциональности ES6 для создания надежного и поддерживаемого кода. - Кроме того, использование Figma для совместной работы над дизайном и интеграция VisualStudio и VS Code в процесс разработки для обеспечения качества и согласованности кода.",
      "companyLogo": ""
    },
    {
      "date": {
        "from": "Февраль 2022",
        "to": "Октябрь 2022",
        "duration": "9 месяцев"
      },
      "title": "Angular Developer",
      "company": "Emap - RsSchool",
      "page": "https://www.epam.com/",
      "description": "- Участие в интенсивной программе Front-End разработки в Emap - RsSchool, погружение в мир веб-разработки. Освоение комплексного набора навыков, включая HTML, CSS, JavaScript, TypeScript и Angular, создание прочной основы для современной веб-разработки. Преуспевание в требовательной образовательной среде с высокой долей отсева, где только 46 из 600 участников проявили приверженность, упорство и завершили программу. Горжусь тем, что я один из преданных людей, достигших этого значительного рубежа. Эффективное применение полученных знаний и навыков в реальных проектах, получение практического опыта в проектировании и разработке удобных веб-интерфейсов. Значительный успех, получение сертификата о завершении, подтверждающего мою экспертизу в Front-End разработке и подтверждающего мою приверженность к этому направлению. Отслеживание последних трендов и лучших практик в веб-разработке, поддержание актуальности в этой постоянно развивающейся области. Использование инструментов, таких как Figma для веб-дизайна, Git и Github для контроля версий, REST API для интеграции данных, и RxJS для эффективной обработки данных. Применение JSON для обмена данными и оптимизация кода с использованием VS Code и VisualStudio. Профессиональное использование Chrome DevTools для отладки и улучшения веб-приложений.",
      "companyLogo": ""
    },
    {
      "date": {
        "from": "Июнь 2019",
        "to": "Май 2021",
        "duration": "2 года"
      },
      "title": "Graphic Designer",
      "company": "Apacer Technology Inc.",
      "page": "https://www.apacer.com/",
      "description": "- Специализация на создании привлекающих внимание рекламных баннеров, адаптированных специально для социальных медиа. - Тесное сотрудничество с командами маркетинга для обеспечения эффективной передачи сообщений о продуктах через визуально привлекательный контент. - Адаптация дизайнов для удовлетворения уникальных требований различных социальных медиа-платформ, оптимизация их визуального воздействия и обеспечение бесшовного пользовательского опыта. - Проведение A/B тестирования и внесение корректировок на основе данных, постоянное улучшение уровня вовлеченности и кликов, что способствовало повышению общей эффективности рекламных кампаний. - Значительный вклад в маркетинговые усилия компании, создание визуально привлекательных и ориентированных на конверсии рекламных материалов для кампаний в социальных медиа, использование таких инструментов дизайна, как Adobe Photoshop, Adobe Illustrator и Figma.",
      "companyLogo": ""
    },
    {
      "date": {
        "from": "Май 2018",
        "to": "Август 2019",
        "duration": "1 год 4 месяца"
      },
      "title": "Graphic Designer",
      "company": "Bet888win",
      "page": "https://bet888win.net/",
      "description": "- Создание динамичных рекламных баннеров на футбольную тематику, специально адаптированных для социальных медиа-платформ для продвижения матчей и событий. - Тесное сотрудничество с командами маркетинга для обеспечения своевременного создания привлекательного контента, который резонирует с целевой аудиторией. - Использование навыков дизайна с такими инструментами, как Adobe Photoshop, Adobe Illustrator и Figma для создания визуально привлекательных баннеров, способствующих более высокой вовлеченности пользователей. - Адаптация и оптимизация дизайнов для удовлетворения специфических требований различных социальных медиа-платформ, обеспечение эффективного охвата и вовлеченности целевой аудитории.",
      "companyLogo": ""
    }
  ],
  "projects": {
    "section_title": "ПРОЕКТЫ",
    "projects_text": "Здесь представлены некоторые из моих личных и клиентских проектов, для каждого из которых подготовлено отдельное исследование."
  }
}
