{
  "header": {
    "home": "Главная",
    "about": "Обо мне",
    "experience": "Опыт",
    "projects": "Проекты",
    "contact": "Контакты",
    "open_resume": "Открыть Резюме",
    "download_cv": "Скачать Резюме"
  },
  "welcome": {
    "owner_name": "азат фарманян",
    "owner_profession": "Инженер-программист",
    "about_me_button": "Обо мне",
    "open_resume_button": "Открыть Резюме",
    "linkedin_alt": "linkedin",
    "github_alt": "github",
    "telegram_alt": "telegram",
    "discord_alt": "discord",
    "instagram_alt": "instagram",
    "facebook_alt": "facebook"
  },
  "about": {
    "section_title": "Обо мне",
    "intro_text": "Здесь вы найдете больше информации обо мне, чем я занимаюсь, и мои текущие навыки в основном в области программирования и технологий.",
    "get_to_know_me": "Познакомьтесь со мной!",
    "introduction": "Здравствуйте! Меня зовут Азат Фарманян, я креативный и инновационный разработчик и дизайнер с дипломом по информационным системам и технологиям, который я получил в 2023 году в Самцхе-Джавахетском государственном университете на факультете инженерии, сельского хозяйства и жизненных наук.",
    "experience_epam": "Мое путешествие началось в <a href='https://www.epam.com/' target='_blank'><b>Emap</b></a>, где я освоил фронтенд-разработку через интенсивный курс в RsSchool и успешно применил знания на практике, участвуя в реальных проектах и получив сертификат. Мой опыт работы в <a href='https://www.apacer.com/' target='_blank'><b>Apacer Technology Inc.</b></a> и <a href='https://bet888win.net/' target='_blank'><b>Bet888win</b></a>, где я работал графическим дизайнером, позволил мне создавать визуально привлекательные рекламные баннеры и адаптировать их для различных социальных платформ, способствуя успешным маркетинговым кампаниям.",
    "experience_geo_alpha": "В <a href='https://geoalphasolutions.com/' target='_blank'><b>GeoAlphaSolution</b></a> я внес значительный вклад в проекты, такие как <a href='https://www.faircontent.media/home' target='_blank'><b><u>FairContent.media</u></b></a> и <a href='http://www.swiftness.co.il/' target='_blank'><b><u>Swiftness</u></b></a>. Мои знания HTML, CSS, SCSS, JavaScript, TypeScript и Angular помогли улучшить интерфейсы и эффективно работать над проектами в различных областях, поддерживая высокие стандарты инноваций.",
    "experience_cyberia_soft": "В <a href='https://www.cyberiasoft.com/' target='_blank'><b>CyberiaSoft</b></a> я провел год и три месяца, улучшая системы управления веб-магазинами, используя HTML, CSS, SCSS, JavaScript, TypeScript и Angular для создания удобных интерфейсов. Моя работа с GitLab и REST API, а также внедрение адаптивного дизайна увеличили удовлетворенность пользователей и обеспечили продуктивное сотрудничество с межфункциональными командами.",
    "current_work": "С марта 2024 года я работаю в <a href='https://background.digital/' target='_blank'><b>Background Digital</b></a>, где создаю веб-приложения для строительных комплексов, таких как <a href='https://river-house.ru/' target='_blank'><b><u>River House</u></b></a>, <a href='https://malahovkahouse.ru/' target='_blank'><b><u>Malahovka House</u></b></a> и <a href='https://3-red.com' target='_blank'><b><u>3 Red</u></b></a>. Мои навыки в Angular 2+, HTML5, CSS3 и SCSS помогают мне разрабатывать интуитивно понятные и эффективные интерфейсы. Я активно использую Node.js и Express для бэкэнда, а тестирование с помощью Jest/Karma/Jasmine обеспечивает высокое качество кода. Мой опыт работы с гибкими графиками и официальное трудоустройство по Трудовому кодексу РФ подтверждают мою репутацию надежного и ответственного разработчика.",
    "languages": "Я свободно владею армянским, грузинским, русским и английским языками. Эти языковые навыки позволяют мне эффективно общаться и работать в многоязычных и международных командах. Моя креативность, технические навыки и способность быстро адаптироваться к новым вызовам делают меня ценным партнером для любого проекта. Я всегда стремлюсь к совершенству и готов использовать свои знания для достижения выдающихся результатов.",
    "my_skills": "Мои навыки"
  },
  "experience-page": {
    "work_experience": "Опыт работы"
  },
  "experience": [
    {
      "date": {
        "from": "Октябрь 2024",
        "to": "По настоящее время",
        "duration": ""
      },
      "title": "Angular Разработчик",
      "company": "Rick Masters",
      "page": "http://rikmasters.ru/",
      "description": "- Участие в проектировании и разработке веб-приложений с использованием Angular, TypeScript и RxJS. - Выполнение рефакторинга кода для повышения производительности и удобства сопровождения. - Принятие архитектурных решений и реализация компонентного подхода к разработке. - Разработка адаптивных макетов и интеграция внешнего интерфейса с серверными системами через REST API. - Тесное сотрудничество с дизайнерами (Фигма), инженерами по обеспечению качества и разработчиками в среде Agile (Scrum). - Активно участвовать в разработке продуктов, предлагая инновационные решения для улучшения пользовательского опыта.",
      "companyLogo": "rik-masters.png"
    },
    {
      "date": {
        "from": "Март 2024",
        "to": "По настоящее время",
        "duration": ""
      },
      "title": "Full Stack Разработчик",
      "company": "Background Digital",
      "page": "https://background.digital/",
      "description": "- Разработал веб-приложения с использованием Angular 2+ для сайтов строительных проектов, таких как https://river-house.ru/, https://malahovkahouse.ru/, и https://3-red.com. - Использовал HTML-5, CSS-3, SCSS, Jade, Swig, ES-5/6 для создания эффективных и удобных интерфейсов. - Работал с основными командами Git для контроля версий. - Также применял знания Angular 2, Node.js, Express, Jest/Karma/Jasmine для тестирования и обеспечения качества кода. - Поддерживал высокий уровень производительности с использованием современных инструментов и методологий разработки. - Работал в соответствии с официальными условиями трудового договора по Трудовому кодексу Российской Федерации, с гибким графиком и возможностью удаленной работы.",
      "companyLogo": "backgound.png"
    },
    {
      "date": {
        "from": "Январь 2023",
        "to": "Март 2024",
        "duration": "1 год 3 месяца"
      },
      "title": "Angular Разработчик",
      "company": "CyberiaSoft",
      "page": "https://www.cyberiasoft.com/",
      "description": "- Владение HTML, CSS, SCSS, JavaScript, TypeScript и Angular, разработка и улучшение веб-ориентированных систем управления магазинами. - Сотрудничество с межфункциональными командами для обеспечения соответствия бизнес-требованиям, использование GitLab для контроля версий и интеграция REST API для обмена данными. - Применение DevExtreme и Frontend JS от DevExtreme для создания интерактивного и визуально привлекательного пользовательского интерфейса, использование RxJS и JSON для эффективной обработки данных. - Реализация методов адаптивного дизайна для обеспечения оптимальной работы на различных устройствах, улучшение пользовательского опыта. - Соблюдение методологии Agile для эффективной доставки функций, использование VS Code в качестве среды разработки и DevExpress для дополнительных инструментов и библиотек. - Проведение тестирования и оптимизации для обеспечения качества и производительности систем. - Предоставление технической поддержки и обучения конечным пользователям, обеспечение их эффективного использования веб-ориентированных систем управления магазинами. - Следование актуальным трендам в индустрии для постоянного улучшения системы и поддержания инновационного подхода.",
      "companyLogo": "cyberiasoft.png"
    },
    {
      "date": {
        "from": "Июнь 2022",
        "to": "Май 2023",
        "duration": "1 год"
      },
      "title": "Angular Разработчик",
      "company": "GeoAlphaSolution",
      "page": "https://geoalphasolutions.com/",
      "description": "- Существенный вклад в разработку двух различных проектов: 1) FairContent.media: Важная роль в создании онлайн-рынка FairContent.media, позволяющего пользователям покупать и продавать различные товары, включая книги, видео, музыку и документы. [Сайт: https://www.faircontent.media/home] 2) Swiftness: Руководство разработкой Swiftness, цифровой платформы, революционизирующей рынок пенсионных накоплений. [Сайт: http://www.swiftness.co.il/] - Применение навыков в HTML, CSS, SCSS, JavaScript, TypeScript и Angular для создания удобных и адаптивных интерфейсов для обоих проектов, значительно улучшение общего пользовательского опыта. - Тесное сотрудничество с междисциплинарными командами, обеспечение соответствия проектным целям и бизнес-требованиям. Использование GitHub для контроля версий и интеграции REST API для эффективного обмена данными, использование RxJS и JSON для бесшовной обработки данных. - Демонстрация гибкости, успешная работа над разнообразными проектами в различных отраслях, демонстрация гибкого набора навыков и способности быстро адаптироваться к меняющимся условиям. - Поддержание высокого уровня инноваций и эффективности, отслеживание последних тенденций в разработке Angular. Использование инструментов разработки, таких как VS Code, для плавного и продуктивного рабочего процесса. Применение принципов объектно-ориентированного программирования (OOP) и функциональности ES6 для создания надежного и поддерживаемого кода. - Кроме того, использование Figma для совместной работы над дизайном и интеграция VisualStudio и VS Code в процесс разработки для обеспечения качества и согласованности кода.",
      "companyLogo": "GeoAlpha-Solutions.png"
    },
    {
      "date": {
        "from": "Февраль 2022",
        "to": "Октябрь 2022",
        "duration": "9 месяцев"
      },
      "title": "Angular Разработчик",
      "company": "Emap - RsSchool",
      "page": "https://www.epam.com/",
      "description": "- Участие в интенсивной программе Front-End разработки в Emap - RsSchool, погружение в мир веб-разработки. Освоение комплексного набора навыков, включая HTML, CSS, JavaScript, TypeScript и Angular, создание прочной основы для современной веб-разработки. Преуспевание в требовательной образовательной среде с высокой долей отсева, где только 46 из 600 участников проявили приверженность, упорство и завершили программу. Горжусь тем, что я один из преданных людей, достигших этого значительного рубежа. Эффективное применение полученных знаний и навыков в реальных проектах, получение практического опыта в проектировании и разработке удобных веб-интерфейсов. Значительный успех, получение сертификата о завершении, подтверждающего мою экспертизу в Front-End разработке и подтверждающего мою приверженность к этому направлению. Отслеживание последних трендов и лучших практик в веб-разработке, поддержание актуальности в этой постоянно развивающейся области. Использование инструментов, таких как Figma для веб-дизайна, Git и Github для контроля версий, REST API для интеграции данных, и RxJS для эффективной обработки данных. Применение JSON для обмена данными и оптимизация кода с использованием VS Code и VisualStudio. Профессиональное использование Chrome DevTools для отладки и улучшения веб-приложений.",
      "companyLogo": "epam.png"
    },
    {
      "date": {
        "from": "Июнь 2019",
        "to": "Май 2021",
        "duration": "2 года"
      },
      "title": "Графический дизайнер",
      "company": "Apacer Technology Inc.",
      "page": "https://www.apacer.com/",
      "description": "- Специализация на создании привлекающих внимание рекламных баннеров, адаптированных специально для социальных медиа. - Тесное сотрудничество с командами маркетинга для обеспечения эффективной передачи сообщений о продуктах через визуально привлекательный контент. - Адаптация дизайнов для удовлетворения уникальных требований различных социальных медиа-платформ, оптимизация их визуального воздействия и обеспечение бесшовного пользовательского опыта. - Проведение A/B тестирования и внесение корректировок на основе данных, постоянное улучшение уровня вовлеченности и кликов, что способствовало повышению общей эффективности рекламных кампаний. - Значительный вклад в маркетинговые усилия компании, создание визуально привлекательных и ориентированных на конверсии рекламных материалов для кампаний в социальных медиа, использование таких инструментов дизайна, как Adobe Photoshop, Adobe Illustrator и Figma.",
      "companyLogo": "Apacer-Logo.png"
    },
    {
      "date": {
        "from": "Май 2018",
        "to": "Август 2019",
        "duration": "1 год 4 месяца"
      },
      "title": "Графический дизайнер",
      "company": "Bet888win",
      "page": "https://bet888win.net/",
      "description": "- Создание динамичных рекламных баннеров на футбольную тематику, специально адаптированных для социальных медиа-платформ для продвижения матчей и событий. - Тесное сотрудничество с командами маркетинга для обеспечения своевременного создания привлекательного контента, который резонирует с целевой аудиторией. - Использование навыков дизайна с такими инструментами, как Adobe Photoshop, Adobe Illustrator и Figma для создания визуально привлекательных баннеров, способствующих более высокой вовлеченности пользователей. - Адаптация и оптимизация дизайнов для удовлетворения специфических требований различных социальных медиа-платформ, обеспечение эффективного охвата и вовлеченности целевой аудитории.",
      "companyLogo": "bet-888.png"
    }
  ],
  "projects": {
    "section_title": "ПРОЕКТЫ",
    "projects_text": "Здесь представлены некоторые из моих личных и клиентских проектов, для каждого из которых подготовлено отдельное исследование.",
    "projects_list": [
      {
        "id": 19,
        "title": "User Filter Application",
        "description": [
          "Этот проект — веб-приложение на Angular, которое позволяет пользователям фильтровать список пользователей, полученных с сервера. Для целей данного тестового задания я имитировал сервер, используя локальный JSON-файл для получения данных пользователей.",
          "Основные функции включают валидацию ввода с помощью регулярных выражений, фильтрацию на стороне клиента на основе полученных данных и переключение статуса 'Заблокировать/Разблокировать' для каждого пользователя. Этот статус сохраняется в локальном хранилище браузера, что позволяет отображать обновленное значение при перезагрузке страницы.",
          "Основная цель проекта — продемонстрировать работу с формами, инпутами и таблицей, а также создание сервисов и взаимодействие между компонентами. Приложение обеспечивает чистый и удобный интерфейс для фильтрации, валидации и управления данными пользователей."
        ],
        "banner": "user-filter-app-screenshot1.png",
        "bannerSmall": "user-filter-app-banner-small.png",
        "screenshots": [
          "user-filter-app-screenshot2.png",
          "user-filter-app-screenshot1.png"
        ],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "TypeScript",
          "RxJs",
          "VS Code",
          "Figma"
        ],
        "seeLive": "https://user-filter-app-angular.netlify.app/user-settings",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/UserFilterApp",
        "designTemplate": "https://www.figma.com/file/NcDTaAYcLBL6ogy1Nxf5Ey/testcase-rik-angular?node-id=0%3A1&t=ZCRud6nfITOJa0sw-1",
        "isNewProject": true
      },
      {
        "id": 18,
        "title": "Currency Converter",
        "description": [
          "Наш проект — это простое веб-приложение, созданное на Angular для удобного преобразования валют. Оно позволяет пользователям быстро конвертировать суммы между различными валютами, обеспечивая точность на каждом этапе процесса.",
          "Список основных функций: Выбор и конвертация валют; Переключение валют; Ввод суммы для конвертации; Валидация введённых данных; Отображение точных результатов с учётом текущего обменного курса.",
          "Мы получаем данные об обменных курсах валют через API от App.FreeCurrencyApi.com, что позволяет нам предоставлять актуальные и своевременные результаты. Цель проекта — предложить простой, но эффективный инструмент для быстрой конвертации валют. Мы используем Angular 17, HTML/SCSS, TypeScript, RxJs, REST API и валидацию входных данных для обеспечения точности результатов."
        ],
        "banner": "currency-converter-app-banner.png",
        "bannerSmall": "currency-converter-app-banner-small.png",
        "screenshots": ["currency-converter-app-banner.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "TypeScript",
          "RxJs",
          "VS Code",
          "Figma"
        ],
        "seeLive": "https://currency-converter-ng17.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/currency-converter-app",
        "isNewProject": true
      },
      {
        "id": 17,
        "title": "Product Page",
        "description": [
          "Моя работа над макетом страницы продукта в Angular 17 выходит за рамки простой кнопки 'Добавить в корзину'. Я добавил несколько других интерактивных элементов для улучшения пользовательского опыта. В частности, я создал удобное поле для поиска с возможностью очистки введённого текста и кнопку поиска для удобства пользователей.",
          "Кроме того, на странице имеются кнопки для переключения уведомлений и добавления продукта в избранное с привлекательными анимациями. Каждая кнопка динамически реагирует на состояние наведения, фокуса и активности, добавляя дополнительный уровень интерактивности и удобства для пользователя.",
          "Наконец, я также реализовал функциональность прокрутки слайдера на странице продукта, позволяющую пользователям легко просматривать дополнительные изображения и информацию о продукте. Весь разметка выполнена с использованием Angular 17.2, при этом страница разбита на небольшие компоненты для удобства управления и поддерживаемости проекта."
        ],
        "banner": "compoProductPage-banner.png",
        "bannerSmall": "compoProductPage-small-banner.png",
        "screenshots": ["compoProductPage-banner.png"],
        "tools": ["Angular", "HTML", "SCSS", "TypeScript", "VS Code", "Figma"],
        "seeLive": "https://dancing-rolypoly-6860d4.netlify.app/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/compo-product-page",
        "designTemplate": "https://www.figma.com/file/QIdMZetqc6405W0CUam7Fa/Product-Page?type=design&node-id=0%3A1&mode=design&t=fehYwRXnmepOBg3k-1"
      },
      {
        "id": 16,
        "title": "Interactive Table",
        "description": [
          "Проект на Angular включает разработку функциональной таблицы с набором возможностей. Сюда входит сортировка, фильтрация, пагинация и настройка видимости столбцов. Используя механизм привязки событий Angular, пользователи могут сортировать строки простым нажатием на заголовки столбцов. Кроме того, поле для поиска облегчает быструю фильтрацию и поиск данных. Пользователи могут настроить количество записей на странице и легко перемещаться по страницам с помощью пагинации. Для улучшения пользовательского опыта интерфейс позволяет скрывать или показывать определённые столбцы, обеспечивая индивидуальную презентацию данных. Проект ориентирован на высокое качество кода и доступность для пользователей на различных устройствах благодаря применению техник адаптивного дизайна.",
          "В итоге, проект на Angular предоставляет комплексное решение для эффективного управления данными в табличном формате. Его расширенные функции отвечают на различные потребности пользователей, от сортировки и фильтрации до настраиваемых представлений, при этом соблюдая высокое качество кода и обеспечивая беспроблемный пользовательский опыт на разных платформах."
        ],
        "banner": "interactive_table-banner_1.png",
        "bannerSmall": "interactive_table-banner_small.png",
        "screenshots": [
          "interactive_table-banner_1.png",
          "interactive_table-banner_2.png",
          "interactive_table-banner_3.png"
        ],
        "tools": ["Angular", "HTML", "SCSS", "TypeScript", "VS Code", "Figma"],
        "seeLive": "https://funny-pixie-42e682.netlify.app/dataTable",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/AngularInteractiveTable"
      },
      {
        "id": 15,
        "title": "Crypto World",
        "description": [
          "Погружайтесь в захватывающий мир криптовалют с Crypto World, сложным веб-приложением, разработанным на Angular. Этот проект демонстрирует мои навыки в разработке фронтенда, предлагая пользователям безупречно интегрированный опыт с различными функциями.",
          "В центре Crypto World находится удобная панель управления, предоставляющая информацию в реальном времени о портфелях, транзакциях и рыночных трендах. Исследуйте обширный раздел рынка, занимайтесь торговлей на популярных биржах и следите за трендами с помощью модуля трендов. Благодаря адаптивному дизайну и улучшенным функциям безопасности, Crypto World представляет собой динамическую экосистему, предназначенную как для опытных энтузиастов криптовалют, так и для новичков, с акцентом на исключительный пользовательский опыт."
        ],
        "banner": "crypto-world-banner.png",
        "bannerSmall": "crypto-world-banner-small.png",
        "screenshots": [
          "crypto-world-banner.png",
          "crypto-world-banner-2.png",
          "crypto-world-banner-3.png",
          "crypto-world-banner-4.png"
        ],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "TypeScript",
          "VS Code",
          "Figma",
          "Photoshop"
        ],
        "seeLive": "https://chipper-maamoul-e7653e.netlify.app/dashboard",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/CryptoWORLD"
      },
      {
        "id": 14,
        "title": "MP3 Player",
        "description": [
          "Angular MP3 Player: Откройте ритм музыки. Погружайтесь в мир гармонии с нашим Angular MP3 Player, простым, но элегантным приложением для ваших любимых мелодий. Это простое, но стильное приложение предлагает захватывающий опыт для любителей музыки.",
          "С коллекцией разнообразных треков под рукой вы можете погружаться в мир мелодий. Наш удобный интерфейс обеспечивает лёгкую навигацию, позволяя без усилий воспроизводить, приостанавливать, пропускать треки или возвращаться к предыдущим — всё это одним щелчком мыши.",
          "Испытайте чистую радость от музыки без лишнего хаоса. Независимо от того, наслаждаетесь ли вы успокаивающими мелодиями классики или танцуете под ритмы современных битов, наш Angular MP3 Player гарантирует, что вы всегда будете контролировать своё музыкальное путешествие.",
          "Так зачем ждать? Погружайтесь в музыку, позволяйте нотам унести вас, и заново откройте радость простых, но восхитительных звуков. Это не просто приложение; это портал в симфонию жизни."
        ],
        "banner": "player-1.png",
        "bannerSmall": "mp3-player-banner-small.png",
        "screenshots": ["player-1.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "VS Code",
          "Figma"
        ],
        "seeLive": "https://loquacious-unicorn-9da2c9.netlify.app/player",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/music-player"
      },
      {
        "id": 13,
        "title": "Pizza Cheff",
        "description": [
          "Pizza Cheff — это аппетитный кулинарный проект, созданный для того, чтобы отпраздновать искусство приготовления пиццы. Эта визуально привлекательная веб-страница предлагает заманчивый взгляд на мир сырных, соусных и вкусных пицц. От классических Маргарит до смелых комбинаций вкусов, Pizza Cheff демонстрирует обширный выбор восхитительных опций, способных удовлетворить любые вкусовые предпочтения любителей пиццы.",
          "Наша веб-страница радует глаз высококачественными изображениями тщательно приготовленных пицц, которые заставят ваши вкусовые рецепторы трепетать. Pizza Cheff также предлагает простые в следовании рецепты и пошаговые инструкции, что делает её отличным ресурсом для начинающих поваров, желающих воспроизвести магию пиццерий прямо у себя на кухне.",
          "В Pizza Cheff мы не просто о пицце; мы о том, чтобы делиться страстью к кулинарному искусству. Будь вы опытным профессионалом или новичком, эта страница — ваш путь в мир вкусного удовлетворения. Присоединяйтесь к нам в этом восхитительном путешествии по миру пиццы и откройте секреты создания идеальной пиццы.",
          "С её аппетитными визуализациями и исчерпывающими руководствами, Pizza Cheff — это доказательство вкусного и креативного мира приготовления пиццы. Погружайтесь на нашу страницу, и вскоре вы сможете овладеть искусством создания пиццы."
        ],
        "banner": "pizza-cheff.png",
        "bannerSmall": "pizza-cheff-banner-small.jpg",
        "screenshots": ["pizza-cheff.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://papaya-praline-2e765d.netlify.app/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/pizzaCheff"
      },
      {
        "id": 12,
        "title": "Приложение Постов",
        "description": [
          "Добро пожаловать в Приложение Постов, ваш личный портал в мир историй, обмена опытом и общения. Независимо от того, являетесь ли вы опытным блогером, заядлым читателем или просто ищете возможность связаться с единомышленниками, наше приложение создано для того, чтобы предоставить вам мир постов и историй на кончиках пальцев.",
          "С Приложением Постов пользователи могут создавать аккаунты, входить в систему и начать путешествие по исследованию. После входа в систему у вас будет доступ к большому количеству постов, каждый из которых рассказывает уникальную историю или делится ценными знаниями. Независимо от того, интересуют ли вас истории о путешествиях, блоги о стиле жизни или обзоры технологий, вы найдете разнообразный контент для взаимодействия.",
          "Но Приложение Постов — это не только чтение; это также возможность общения. Исследуйте профили пользователей и карточки о них, чтобы узнать больше о писателях за постами. Откройте для себя общие интересы, свяжитесь с единомышленниками и участвуйте в значимых обсуждениях с теми, кто разделяет вашу страсть.",
          "Присоединяйтесь к растущему сообществу читателей и писателей, которые сделали Приложение Постов своей основной платформой для повествования и общения. Независимо от того, хотите ли вы делиться своими постами или открывать новые перспективы, наше приложение — это ваш портал в мир историй и связи. Скачайте Приложение Постов сегодня и начните делиться, открывать и соединяться новым и захватывающим образом!"
        ],
        "banner": "posts-app-2.png",
        "bannerSmall": "posts-app-banner-small.jpg",
        "screenshots": [
          "posts-app-1.png",
          "posts-app-2.png",
          "posts-app-3.png"
        ],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://mypostsapp.netlify.app/login",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/postsApp"
      },
      {
        "id": 11,
        "title": "Приложение Пользователей",
        "description": [
          "Добро пожаловать в Приложение Пользователей, ваше универсальное решение для управления пользователями. Независимо от того, являетесь ли вы администратором, организатором сообщества или просто ищете эффективный способ управления профилями пользователей, наше приложение создано для упрощения процесса и предоставления вам контроля.",
          "С Приложением Пользователей вы можете легко создавать и отображать профили пользователей с портретами. Каждый профиль настраиваемый, что позволяет вам добавлять и редактировать информацию о пользователе, включая портрет, имя, контактные данные и многое другое. Прощайте, трудности с бумажной работой и множеством таблиц; наше приложение упрощает управление пользователями с помощью удобного интерфейса.",
          "Нужно обновить информацию или портрет пользователя? Нет проблем. Приложение Пользователей позволяет вносить изменения в реальном времени, обеспечивая актуальность ваших записей. А если пришло время попрощаться с пользователем, наше приложение предлагает простую функцию удаления, позволяя вам легко удалять профили, сохраняя целостность данных.",
          "Присоединяйтесь к растущему сообществу пользователей, которые полагаются на Приложение Пользователей для эффективного и организованного управления пользователями. Независимо от того, управляете ли вы небольшой организацией или большой базой данных пользователей, наше приложение поможет вам справиться с задачей. Пора взять под контроль ваши профили пользователей и сделать управление пользователями легким. Скачайте Приложение Пользователей сегодня и ощутите удобство упрощенного управления пользователями!"
        ],
        "banner": "card-app-1.png",
        "bannerSmall": "card-app-banner-small.jpg",
        "screenshots": ["card-app-1.png", "card-app-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://majestic-melomakarona-c93ab4.netlify.app/users-page",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/UsersApp_Angular"
      },
      {
        "id": 10,
        "title": "Мировая Лига Паттинга",
        "description": [
          "Добро пожаловать в Мировую Лигу Паттинга, эпицентр точности и страсти в мире гольфа. Погрузитесь в уникальный опыт гольфа, где мастерство паттинга выходит на первый план, а игроки со всего мира собираются вместе, чтобы продемонстрировать свои навыки.",
          "Наша лига — это не просто соревнование; это празднование искусства и науки паттинга. Независимо от того, являетесь ли вы опытным профессионалом или новичком на зеленом поле, Мировая Лига Паттинга предлагает платформу для участия и соревнования для всех. Наша инклюзивная среда способствует товариществу и спортивному духу, одновременно расширяя границы того, что возможно на паттинг-поле.",
          "Следите за последними результатами, рейтингами и событиями, погружаясь в захватывающий мир паттинга. С сообществом увлеченных гольфистов и энтузиастов, Мировая Лига Паттинга — это место, где сбываются мечты, устанавливаются рекорды и формируются lifelong friendships.",
          "Присоединяйтесь к нам в этом путешествии, где каждый патт считается, а стремление к совершенству не знает границ. Независимо от того, являетесь ли вы гольфистом по призванию или просто интересуетесь искусством точности, Мировая Лига Паттинга приглашает вас испытать гольф по-новому. Приготовьтесь покататься с нами и откройте для себя магию паттинга как никогда прежде."
        ],
        "banner": "wpl-banner.jpg",
        "bannerSmall": "wpl-banner-small.jpg",
        "screenshots": ["wpl-1.png", "wpl-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://unrivaled-duckanoo-78dd09.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/world-putting-league"
      },
      {
        "id": 9,
        "title": "Приложение для Скоростного Печатания",
        "description": [
          "Добро пожаловать в Приложение для Скоростного Печатания, ваш идеальный инструмент для улучшения навыков печати. Независимо от того, являетесь ли вы профессионалом, стремящимся повысить продуктивность, или учеником, желающим улучшить свои навыки на клавиатуре, наше приложение поможет вам достичь ваших целей по печати с точностью и эффективностью.",
          "Наше Приложение для Скоростного Печатания предлагает ряд настраиваемых функций, позволяя вам адаптировать практику печати под ваши конкретные нужды. Вы можете выбрать предпочитаемый таймер, установить цели по количеству слов и выбрать уровни сложности, чтобы создать персонализированный опыт печати. Независимо от того, есть ли у вас всего несколько минут или вы хотите провести более продолжительную сессию печати, наше приложение адаптируется к вашему графику.",
          "Во время печати Приложение для Скоростного Печатания предоставляет обратную связь в реальном времени, отслеживая вашу скорость, точность и количество слов. Оно предлагает библиотеку слов и фраз для постоянного вызова и тренировки ваших навыков печати. С каждой сессией вы будете печатать быстрее, точнее и с большим доверием.",
          "Присоединяйтесь к растущему сообществу пользователей, которые улучшили свои навыки с помощью нашего Приложения для Скоростного Печатания. Независимо от того, готовитесь ли вы к работе, требующей молниеносного набора текста, или просто хотите стать более эффективным в повседневных задачах, наше приложение станет вашим идеальным спутником. Скачайте его сегодня и наблюдайте, как ваши навыки печати достигают новых высот!"
        ],
        "banner": "speen-typing-banner.jpg",
        "bannerSmall": "speen-typing-banner-small.jpg",
        "screenshots": ["speen-typing-1.png", "speen-typing-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://chic-cat-2246b2.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/speed-typing-Angular-app"
      },
      {
        "id": 8,
        "title": "Игра в Карты Блот",
        "description": [
          "Добро пожаловать в Приложение для Подсчета Очков в Игре в Карты Блот, ваш идеальный помощник для подсчета очков в этой классической и увлекательной карточной игре. Независимо от того, являетесь ли вы опытным игроком в Блот или только начинаете свое путешествие, наше приложение предназначено для того, чтобы сделать подсчет очков легким и добавить изюминку в ваше игровое времяпрепровождение.",
          "С нашим удобным и интуитивно понятным интерфейсом вы сможете сосредоточиться на игре, не отвлекаясь на подсчет очков. Больше не нужно мучиться с ручкой и бумагой или пытаться запомнить, кто выигрывает; наше приложение возьмет на себя все математические расчеты. Просто введите очки, и пусть Приложение для Подсчета Очков в Игре в Карты Блот сделает остальное.",
          "Но мы не ограничиваемся только функциональностью; мы стремимся добавить стиль в вашу игру. Наше приложение предлагает настраиваемые темы и визуально привлекательные карточки для подсчета очков, чтобы улучшить ваш игровой опыт в Блот. Независимо от того, предпочитаете ли вы классическую элегантность или более современный вид, вы можете выбрать тему, которая соответствует вашему вкусу.",
          "Присоединяйтесь к сообществу игроков в Блот и улучшите свои карточные сессии с помощью нашего Приложения для Подсчета Очков в Игре в Карты Блот. Это не только подсчет очков; это возможность сделать ваши игровые моменты легкими и стильными. Скачайте наше приложение сегодня и достигайте победы со стилем!"
        ],
        "banner": "blot-app-banner.png",
        "bannerSmall": "blot-app-banner-small.png",
        "screenshots": ["blot-app-1.png", "blot-app-2.png"],
        "tools": [
          "Angular",
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Figma"
        ],
        "seeLive": "https://steady-biscotti-58c415.netlify.app/blot",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/blot-app"
      },
      {
        "id": 7,
        "title": "Приложение Погоды",
        "description": [
          "Добро пожаловать в Приложение Погоды, ваш надежный спутник для отслеживания постоянно меняющегося неба. С нашим удобным и интуитивно понятным приложением вы сможете получать актуальные прогнозы погоды и быть на шаг впереди перед природными изменениями.",
          "Наше Приложение Погоды предлагает бесперебойный опыт, предоставляя точную и подробную информацию о погоде прямо у вас под рукой. Независимо от того, планируете ли вы уикенд, назначаете ли вы мероприятия на улице или просто хотите узнать, что ожидать в вашем ежедневном пути на работу, наше приложение будет полезным.",
          "Оставайтесь в курсе с обновлениями погоды в реальном времени, тенденциями температуры, прогнозами осадков и многим другим. С простым в навигации интерфейсом и настраиваемыми функциями вы можете адаптировать ваш опыт с погодой под ваши нужды. Будь вы любителем погоды или просто хотите знать, понадобится ли вам зонтик, наше Приложение Погоды поможет сделать ваш день более предсказуемым и приятным.",
          "Присоединяйтесь к миллионам пользователей, которые полагаются на наше приложение для получения ежедневных обновлений погоды. Оцените удобство знания прогноза в любом месте и будьте готовы к любым погодным условиям. Скачайте наше Приложение Погоды сегодня и будьте готовы к любым погодным сюрпризам!"
        ],
        "banner": "weather-app-banner.jpg",
        "bannerSmall": "weather-app-banner-small.jpg",
        "screenshots": [
          "weather-app-1.png",
          "weather-app-2.png",
          "weather-app-3.png"
        ],
        "tools": [
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Angular",
          "Figma"
        ],
        "seeLive": "https://deft-liger-7c9069.netlify.app/home",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/weather-app"
      },
      {
        "id": 6,
        "title": "Английский для Детей",
        "description": [
          "Представляем 'Английский для Детей', увлекательное и образовательное приложение, специально разработанное для детей, стремящихся начать изучение английского языка. Созданное с учетом потребностей юных учеников, наше приложение предлагает два захватывающих режима, которые делают изучение языка радостным приключением.",
          "В 'Режиме Обучения' дети могут погрузиться в мир знаний и изучать новые слова с помощью интерактивных уроков и ярких визуализаций. Обучение становится игровой деятельностью, когда дети осваивают словарный запас, произношение и базовые языковые навыки в удобном для них темпе. С нашим удобным интерфейсом и увлекательным контентом, юные умы могут создать прочную основу в английском языке, что поможет им на пути к успеху.",
          "Для тех моментов, когда хочется поразвлекаться, готов 'Игровой Режим'. Здесь дети могут применить свои новые знания на практике в захватывающей игре на угадывание изображений. Воображение и языковые навыки соединяются, когда дети идентифицируют объекты, животных и многое другое, одновременно укрепляя свой английский словарный запас в веселой и интерактивной форме.",
          "'Английский для Детей' — это больше, чем приложение; это образовательный спутник, который развивает любовь к языкам и обучению. Присоединяйтесь к нам в этом увлекательном путешествии, где дети могут расширить свои горизонты, повысить свою уверенность и начать lifelong adventure в языке и открытии. Подарите вашему ребенку английское образование в обертке радости и увлекательности уже сегодня!"
        ],
        "banner": "english-banner.jpg",
        "bannerSmall": "english-banner-small.jpg",
        "screenshots": [
          "english-2.png",
          "english-1.png",
          "english-3.png",
          "english-4.png",
          "english-5.png"
        ],
        "tools": ["HTML", "SCSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/English-for-kids/English-for-kids/pages/main/#",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/English-for-kids"
      },
      {
        "id": 5,
        "title": "Система Управления Проектами",
        "description": [
          "Добро пожаловать в нашу Систему Управления Проектами, мощное приложение, предназначенное для помощи отдельным лицам, командам или группам разработчиков в достижении своих целей эффективно и результативно. В современном быстром мире, где сотрудничество и организация являются ключевыми, наша система предлагает комплексное решение для упрощения ваших потребностей в управлении проектами.",
          "На высококонкурентном рынке мы понимаем, что выбор велик. Известные конкуренты, такие как Trello, Jira, Redmine, Bitrix24, Yandex Tracker, Asana, GanttPro и GitHub Projects, оставили свой след. Однако наша Система Управления Проектами выделяется как надежный и удобный вариант, специально адаптированный для современных команд. С множеством функций, интуитивным интерфейсом и настраиваемым функционалом, мы стремимся предоставить вам возможность взять под контроль ваши проекты и добиться успеха.",
          "Присоединяйтесь к числу довольных пользователей, которые оценили преимущества нашей Системы Управления Проектами. Исследуйте инструменты, повышайте свою продуктивность и испытайте разницу сами. Независимо от того, являетесь ли вы опытным менеджером проекта или только начинаете свое путешествие, мы готовы помочь вам достичь ваших целей эффективно и с уверенностью. Добро пожаловать в будущее управления проектами!"
        ],
        "banner": "proj-man-sys-banner.jpg",
        "bannerSmall": "proj-man-sys-banner-small.jpg",
        "screenshots": [
          "proj-man-sys-1.png",
          "proj-man-sys-2.png",
          "proj-man-sys-3.png"
        ],
        "tools": [
          "HTML",
          "SCSS",
          "JavaScript",
          "TypeScript",
          "Angular",
          "Figma"
        ],
        "seeLive": "https://fascinating-douhua-c23dc0.netlify.app/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/rs-front-azat"
      },
      {
        "id": 4,
        "title": "Приют для Собак и Кошек",
        "description": [
          "Добро пожаловать в 'Приют для Собак и Кошек', трогательную онлайн-платформу, посвященную нашим пушистым друзьям в нужде. Наша миссия проста, но значима: соединить достойных собак и кошек из приютов с любящими навсегда домами.",
          "На нашем сайте вы найдете массу подробной информации о чудесных животных, проживающих в приютах и ожидающих своих будущих владельцев. Каждый профиль рассказывает уникальную историю, демонстрируя личность, историю и индивидуальные потребности этих милых спутников. Если вы ищете верного собачьего друга или очаровательного пушистика, вы можете исследовать наши обширные списки и найти идеального компаньона для вашего дома и сердца.",
          "Мы верим, что каждая лапка заслуживает место, которое можно назвать домом, и мы здесь, чтобы это осуществить. Присоединяйтесь к нам в этом трогательном путешествии сострадания и усыновления, где вместе мы можем изменить жизнь собак и кошек из приютов и принести радость и любовь в ваш дом. Исследуйте наш сайт, познакомьтесь с нашими пушистыми жителями и начните красивое путешествие по усыновлению питомцев уже сегодня."
        ],
        "banner": "shelter-banner.jpg",
        "bannerSmall": "shelter-banner-small.jpg",
        "screenshots": ["shelter-1.png", "shelter-2.png"],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/shelter/pages/main/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/shelter"
      },
      {
        "id": 3,
        "title": "Крестики-нолики",
        "description": [
          "Добро пожаловать в мир Ultimate Tic Tac Toe, где стратегическое мастерство встречается с вечным весельем. Эта классическая игра была переосмыслена и усовершенствована для цифровой эпохи. Независимо от того, являетесь ли вы опытным стратегом или новичком в игре, Ultimate Tic Tac Toe обещает захватывающий опыт, который бросает вызов вашему уму и захватывает ваш соревновательный дух.",
          "Наша цифровая версия крестиков-ноликов оживает благодаря стильному дизайну и интуитивно понятному игровому процессу. Играйте против друзей, семьи или ИИ-противников с различными уровнями сложности. С отзывчивыми управлениями, оптимизированными для веб и мобильных устройств, вы можете наслаждаться Ultimate Tic Tac Toe на любом устройстве.",
          "Но это не просто крестики-нолики; это Ultimate версия. Множественные доски, динамическая игра и стратегическая глубина ждут вас. Каждое ваше движение влияет на игру в целом, добавляя слои сложности и волнения. Сможете ли вы воспользоваться шансом выиграть на главной доске, или ваш соперник вас перехитрит? Только самые умелые игроки смогут одержать победу.",
          "Ultimate Tic Tac Toe — это больше, чем просто игра; это приглашение бросить вызов своему разуму, испытать стратегию и разделить моменты триумфа с друзьями и соперниками. Присоединяйтесь к нам в этом увлекательном игровом приключении и узнайте, сможете ли вы завоевать доску!"
        ],
        "banner": "tic-tac-toe-1.png",
        "bannerSmall": "tic-tac-toe-banner-small.jpg",
        "screenshots": [
          "tic-tac-toe-1.png",
          "tic-tac-toe-2.png",
          "tic-tac-toe-3.png"
        ],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/TicTacToe/pages/game/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/TicTacToe"
      },
      {
        "id": 2,
        "title": "Калькулятор",
        "description": [
          "Представляем Ultimate Calculator, ваш универсальный и отзывчивый помощник для всех математических нужд, будь то на компьютере или мобильном устройстве. Мы преобразовали скромный калькулятор в стильный, удобный инструмент, который адаптируется к вашим расчетам, где бы вы ни находились. На вашем компьютере или ноутбуке наш веб-калькулятор предлагает бесшовный и интуитивно понятный опыт. Независимо от того, нужны ли вам простые арифметические операции или сложные уравнения, отзывчивый дизайн нашего калькулятора гарантирует, что у вас всегда будет мощный инструмент для расчетов под рукой.",
          "Но мы на этом не остановились. Ultimate Calculator также является вашим надежным союзником на мобильных устройствах. Нужно быстро сделать расчеты на ходу? Без проблем! Наша мобильная версия легко адаптируется к вашему смартфону или планшету, предоставляя ту же точность и удобство, которые вы ожидаете. От простой сложения до продвинутой тригонометрии, Ultimate Calculator — это ваш универсальный инструмент для всех ваших математических приключений. Это не просто калькулятор; это гибкий и отзывчивый математический помощник, готовый помочь вам в любое время и в любом месте. Присоединяйтесь к нам и упрощайте ваши расчеты стильно и удобно."
        ],
        "banner": "calc.png",
        "bannerSmall": "calc-banner-small.jpg",
        "screenshots": ["calc.png"],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/calculator/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/calculator"
      },
      {
        "id": 1,
        "title": "Книжный Магазин",
        "description": [
          "Добро пожаловать в Bookshop, цифровое убежище для любителей книг и книжных червей. Погрузитесь в мир, где письменное слово царит. Этот виртуальный книжный магазин — это не просто онлайн-магазин; это святилище для всего, что связано с литературой. Исследуйте обширную коллекцию книг, охватывающую жанры, эпохи и культуры. Создайте свою собственную литературную коллекцию простым нажатием кнопки. А для тех моментов, когда вы ищете конкретный заголовок, наша функция поиска служит вашим надежным гидом. Bookshop превосходит простую электронную коммерцию; это празднование магии письменного слова. Присоединяйтесь к нам в этом литературном приключении и пусть ваша любовь к книгам расцветает."
        ],
        "banner": "bookshop-banner.jpg",
        "bannerSmall": "bookshop-banner-small.jpg",
        "screenshots": ["bookshop-1.png", "bookshop-2.png"],
        "tools": ["HTML", "CSS", "JavaScript", "Figma"],
        "seeLive": "https://azat-farmanyan.github.io/BookShop/pages/main/",
        "sourceCodeUrl": "https://github.com/Azat-Farmanyan/BookShop"
      }
    ]
  },
  "project-card": {
    "see_more": "Узнать больше"
  },
  "project-detail-page": {
    "overview": "Обзор проекта",
    "tools": "Используемые инструменты",
    "see_live": "Посмотреть вживую",
    "see_demo": "СМОТРЕТЬ ДЕМО",
    "source_code": "Исходный код",
    "see_design": "Посмотреть дизайн",
    "go_back": "вернуться назад",
    "return": "Вернуться",
    "return_to_projects": "Вернуться к проектам"
  },
  "steps": {
    "step1": {
      "title": "Шаг 1: Доступ к демонстрационной версии",
      "description": "Вы всего в одном клике от того, чтобы начать использовать нашу демонстрационную версию!",
      "button": "Продолжить"
    },
    "step2": {
      "title": "Шаг 2: Обработка ошибок",
      "description": "Если вы столкнулись с проблемами, не волнуйтесь. Просто нажмите кнопку \"Вернуться на наш сайт\" ниже, и вы будете перенаправлены на главную страницу проекта.",
      "button": "Продолжить",
      "backButtonText": "\"Вернуться на наш сайт\""
    },
    "step3": {
      "title": "Шаг 3: Мы готовы помочь",
      "description": "Если у вас есть вопросы или вам нужна помощь, не стесняйтесь",
      "spanText": "связаться с нашей службой поддержки",
      "additionalText": "Мы здесь, чтобы помочь вам. Спасибо за ваш интерес к нашему проекту, и мы надеемся обеспечить вас отличным опытом.",
      "button": "Посмотреть демо"
    }
  },
  "contact": {
    "section_title": "КОНТАКТЫ",
    "description": "Не стесняйтесь связаться со мной, заполнив форму ниже, и я свяжусь с вами как можно скорее.",
    "name": "Имя",
    "name_placeholder": "Введите ваше имя",
    "name_required": "Имя обязательно для заполнения",
    "email": "Электронная почта",
    "email_placeholder": "Введите ваш email",
    "email_required": "Электронная почта обязательна для заполнения",
    "email_invalid": "Электронная почта недействительна",
    "message": "Сообщение",
    "message_placeholder": "Введите ваше сообщение",
    "message_required": "Сообщение обязательно для заполнения",
    "submit_button": "Отправить"
  },
  "footer": {
    "name": "Азат Фарманян",
    "description": "Frontend-разработчик, сосредоточенный на создании интерфейсов веб-сайтов и веб-приложений, которые способствуют успеху всего продукта.",
    "social_title": "Социальные сети",
    "copyright": "© Copyright 2023. Made by <a href='/home#home'>Azat Farmanyan</a>",
    "navigation": "Навигация"
  }
}
